# IFCProperty Mapping Info Revit Property Id Property

Source: https://www.revitapidocs.com/2026/c74edf77-98cf-cc32-9347-51ac63ea75b9.htm

---

| IFCProperty Mapping Info Revit Property Id Property |
| --- |

The Revit property id.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public ElementId RevitPropertyId { get; set; }
```

```
Public Property RevitPropertyId As ElementId
	Get
	Set
```

```
public:
property ElementId^ RevitPropertyId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

```
member RevitPropertyId : ElementId with get, set
```

#### Property Value

ElementId Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non\-optional argument was null |

See Also

#### Reference

IFCPropertyMappingInfo Class Autodesk.Revit.DB Namespace